MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/NMEA.cpp
/*
  Модуль NMEA.cpp
  Назначение:
  - Формирование и отправка текстовых выходных сообщений о полетных данных.

  Основные задачи модуля:
  - Генерировать NMEA-строки нашего самолета и сторонних целей.
  - Формировать контейнерный текстовый вывод для Serial/RS485/UDP/Bluetooth.
  - Соблюдать выбранные в WEB-интерфейсе режимы вывода.
  - Сопровождать вывод диагностикой и объявлением активного режима Serial.
*/

#include "NMEA.h"
#include "TrafficDB.h"
#include "DeviceInfo.h"
#include "EEPROMRF.h"
#include "RS485Display.h"
#include "Bluetooth.h"
#include "GNSS.h"
#include "WiFiRF.h"
#include <TimeLib.h>
#include <stdio.h>
#include <math.h>
#include <string.h>

#ifndef DEG_TO_RAD
#define DEG_TO_RAD 0.017453292519943295769236907684886f
#endif

static bool g_rs485Ready = false;  // Логический флаг состояния, разрешения или наличия данных.
static NMEADiag g_diag = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
static uint8_t g_lastAnnouncedSerialMode = 0xFFU;  // Параметр конфигурации интерфейса, адресации или выбранного режима.
static uint32_t g_lastPgrmzMs = 0;  // Временная отметка, интервал или значение тайм-аута.

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static const char* serialModeHeaderName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RP2040: return "RP2040 RX";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_LORA_RAW: return "LoRa RAW RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        default: return "Off";
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
void NMEA_announceSerialModeIfNeeded()
{
    const uint8_t mode = (settings != nullptr) ? settings->serial_out : OUTPUT_MODE_OFF;
    if (mode == g_lastAnnouncedSerialMode)
    {
        return;
    }

    g_lastAnnouncedSerialMode = mode;
    if (mode == OUTPUT_MODE_MAVLINK)
    {
        return;
    }

    Serial.print("=== SERIAL MODE: ");
    Serial.print(serialModeHeaderName(mode));
    Serial.print(" ===\r\n");
    vTaskDelay(pdMS_TO_TICKS(4));
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static uint8_t nmeaChecksum(const char* sentenceWithoutChecksum)
{
    uint8_t cs = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (sentenceWithoutChecksum == nullptr) return 0;
    while (*sentenceWithoutChecksum)
    {
        cs ^= (uint8_t)*sentenceWithoutChecksum++;
    }
    return cs;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static size_t wrapNMEALine(const char* body, char* out, size_t outSize)
{
    if (body == nullptr || out == nullptr || outSize < 8)
    {
        return 0;
    }

    const uint8_t cs = nmeaChecksum(body);
    const int written = snprintf(out, outSize, "$%s*%02X\r\n", body, cs);
    if (written <= 0 || (size_t)written >= outSize)
    {
        return 0;
    }
    return (size_t)written;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void rs485Write(const char* data, size_t len)
{
    if (!g_rs485Ready || data == nullptr || len == 0)
    {
        return;
    }

#if SOC_GPIO_PIN_RS485_DE >= 0
    digitalWrite(SOC_GPIO_PIN_RS485_DE, HIGH);
    delayMicroseconds(100);
#endif
    RS485_SERIAL.write((const uint8_t*)data, len);
    RS485_SERIAL.flush();
#if SOC_GPIO_PIN_RS485_DE >= 0
    delayMicroseconds(100);
    digitalWrite(SOC_GPIO_PIN_RS485_DE, LOW);
#endif
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static bool sendNmeaToConfiguredOutput(const char* line, size_t len)
{
    if (settings == nullptr || line == nullptr || len == 0)
    {
        return false;
    }

    g_diag.nmeaOutput = settings->nmea_out;
    g_diag.udpPort = (settings->udp_port != 0U) ? settings->udp_port : WiFi_defaultNmeaUdpPort();
    g_diag.bluetoothMode = settings->bluetooth;

