MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/NMEA.cpp
    bool sent = false;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    switch (settings->nmea_out)
    {
        case NMEA_OUTPUT_SERIAL:
            Serial.write((const uint8_t*)line, len);
            ++g_diag.sentencesSerial;
            sent = true;
            break;
        case NMEA_OUTPUT_UDP:
            if (WiFi_transmitUDP(g_diag.udpPort, (const uint8_t*)line, len))
            {
                ++g_diag.sentencesUDP;
                sent = true;
            }
            break;
        case NMEA_OUTPUT_BLUETOOTH:
            if (settings->bluetooth == BLUETOOTH_LE)
            {
                const size_t written = Bluetooth_write((const uint8_t*)line, len);
                if (written > 0)
                {
                    ++g_diag.sentencesBluetooth;
                    sent = true;
                }
            }
            break;
        case NMEA_OUTPUT_OFF:
        default:
            break;
    }

    if (settings->serial_out == OUTPUT_MODE_NMEA && settings->nmea_out != NMEA_OUTPUT_SERIAL)
    {
        Serial.write((const uint8_t*)line, len);
        ++g_diag.sentencesSerial;
        sent = true;
    }

    if (settings->rs485_out == OUTPUT_MODE_NMEA)
    {
        rs485Write(line, len);
        ++g_diag.sentencesRS485;
        sent = true;
    }

    return sent;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void sendContainerToConfiguredOutputs(const char* line, size_t len)
{
    if (settings == nullptr || line == nullptr || len == 0)
    {
        return;
    }

    g_diag.serialMode = settings->serial_out;
    g_diag.rs485Mode = settings->rs485_out;

    // Для Serial в режиме OUTPUT_MODE_CONTAINER используется штатный дамп
    // ThisAircraft / Container[i] ниже в NMEA_loop().
    // Здесь оставляем вывод контейнера только для RS485, чтобы при выборе
    // "Вывод данных в Serial = Container" в Serial не появлялся второй,
    // лишний формат строк вида ICAO=... .
    if (settings->rs485_out != OUTPUT_MODE_RS485_DISPLAY && settings->rs485_out == OUTPUT_MODE_CONTAINER)
    {
        rs485Write(line, len);
        ++g_diag.sentencesRS485;
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static bool aircraftHasCoordinates(const Aircraft& ac)
{
    return fabsf(ac.lat) > 0.00001f || fabsf(ac.lon) > 0.00001f;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void sanitizeCallsign(const char* src, char* dst, size_t dstSize)
{
    if (dst == nullptr || dstSize == 0) return;
    memset(dst, 0, dstSize);
    if (src == nullptr) return;

    size_t outIdx = 0;  // Счетчик, индекс, позиция или номер элемента.
    for (size_t i = 0; src[i] != '\0' && outIdx < (dstSize - 1); ++i)
    {
        const char c = src[i];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
        if (c == ' ' || c == ',' || c == '*') break;
        dst[outIdx++] = c;
    }
    dst[outIdx] = 0;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void makeFallbackCallsign(const Aircraft& ac, char* dst, size_t dstSize)
{
    if (dst == nullptr || dstSize == 0) return;
    snprintf(dst, dstSize, "T_%06lX", (unsigned long)(ac.addr & 0xFFFFFFUL));
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static bool buildDateTimeFields(char* utcTime, size_t utcTimeSize, char* utcDate, size_t utcDateSize)
{
    if (!GNSS_timeValid() || utcTime == nullptr || utcDate == nullptr || utcTimeSize < 7 || utcDateSize < 7)
    {
        return false;
    }

    const time_t t = now();
    snprintf(utcTime, utcTimeSize, "%02d%02d%02d", hour(t), minute(t), second(t));
    snprintf(utcDate, utcDateSize, "%02d%02d%02d", day(t), month(t), year(t) % 100);
    return true;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - utcTime: Временная отметка, интервал или значение тайм-аута.
// - utcDate: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendOwnshipRMC()
{
    if (settings == nullptr) return;
    if (!GNSS_coordinatesValid() || !GNSS_timeValid()) return;

    const float lat = GNSS_latitude();
    const float lon = GNSS_longitude();
    const char latHem = (lat >= 0.0f) ? 'N' : 'S';
    const char lonHem = (lon >= 0.0f) ? 'E' : 'W';
    const float absLat = fabsf(lat);
    const float absLon = fabsf(lon);
    const int latDeg = (int)absLat;
    const int lonDeg = (int)absLon;
    const float latMin = (absLat - (float)latDeg) * 60.0f;
    const float lonMin = (absLon - (float)lonDeg) * 60.0f;

    char utcTime[16] = {};  // Временная отметка, интервал или значение тайм-аута.
    char utcDate[16] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (!buildDateTimeFields(utcTime, sizeof(utcTime), utcDate, sizeof(utcDate))) return;

    char body[160];  // Параметр геометрии, координаты, размера или угла.
    char sentence[180];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(body, sizeof(body),
             "GPRMC,%s,A,%02d%07.4f,%c,%03d%07.4f,%c,%.1f,%.1f,%s,,,A",
             utcTime,
             latDeg, latMin, latHem,
             lonDeg, lonMin, lonHem,
             ThisAircraft.speed,
             ThisAircraft.course,
             utcDate);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - utcTime: Временная отметка, интервал или значение тайм-аута.
// - utcDate: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendOwnshipGGA()
{
    if (settings == nullptr) return;
    if (!GNSS_coordinatesValid() || !GNSS_timeValid()) return;

    const float lat = GNSS_latitude();
    const float lon = GNSS_longitude();
    const char latHem = (lat >= 0.0f) ? 'N' : 'S';
    const char lonHem = (lon >= 0.0f) ? 'E' : 'W';
    const float absLat = fabsf(lat);
    const float absLon = fabsf(lon);
    const int latDeg = (int)absLat;
    const int lonDeg = (int)absLon;
    const float latMin = (absLat - (float)latDeg) * 60.0f;
    const float lonMin = (absLon - (float)lonDeg) * 60.0f;
    const uint8_t sats = GNSS_satellitesValid() ? GNSS_satellites() : 0U;

    char utcTime[16] = {};  // Временная отметка, интервал или значение тайм-аута.
    char utcDate[16] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (!buildDateTimeFields(utcTime, sizeof(utcTime), utcDate, sizeof(utcDate))) return;
    (void)utcDate;

    char body[160];  // Параметр геометрии, координаты, размера или угла.
    char sentence[180];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(body, sizeof(body),
             "GPGGA,%s,%02d%07.4f,%c,%03d%07.4f,%c,1,%02u,1.0,%.1f,M,0.0,M,,",
             utcTime,
             latDeg, latMin, latHem,
             lonDeg, lonMin, lonHem,
             (unsigned)sats,
             GNSS_altitudeValid() ? GNSS_altitudeMeters() : ThisAircraft.altitude);
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendOwnshipPGRMZ()
{
    if (settings == nullptr) return;
    if ((uint32_t)(millis() - g_lastPgrmzMs) < 1000UL) return;

    const int altitudeFt = constrain((int)lroundf(ThisAircraft.pressure_altitude * 3.28084f), -1000, 60000);
    char body[64];  // Параметр геометрии, координаты, размера или угла.
    char sentence[80];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(body, sizeof(body), "PGRMZ,%d,f,%c", altitudeFt, GNSS_coordinatesValid() ? '3' : '1');
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    if (len > 0)
    {
        sendNmeaToConfiguredOutput(sentence, len);
        g_lastPgrmzMs = millis();
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static int exportSignalSource(uint8_t source)
{
    switch (source)
    {
        case TRAFFIC_SOURCE_FLARM_LORA: return 1;
        case TRAFFIC_SOURCE_ADSB_DUMP1090: return 2;
        default: return 0;
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - callsign: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendOwnshipFLYRF()
{
    if (settings == nullptr) return;
    if (ThisAircraft.addr == 0U) return;

    const bool hasCoords =
        (fabsf(ThisAircraft.latitude) > 0.00001f || fabsf(ThisAircraft.longitude) > 0.00001f ||
         fabsf(ThisAircraft.local_latitude) > 0.00001f || fabsf(ThisAircraft.local_longitude) > 0.00001f ||
         fabsf(ThisAircraft.old_latitude) > 0.00001f || fabsf(ThisAircraft.old_longitude) > 0.00001f);
    if (!hasCoords) return;

    float lat = ThisAircraft.latitude;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
    float lon = ThisAircraft.longitude;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
    if (fabsf(lat) <= 0.00001f && fabsf(lon) <= 0.00001f)
    {
        lat = ThisAircraft.local_latitude;
        lon = ThisAircraft.local_longitude;
    }
    if (fabsf(lat) <= 0.00001f && fabsf(lon) <= 0.00001f)
    {
        lat = ThisAircraft.old_latitude;
        lon = ThisAircraft.old_longitude;
    }

    char callsign[16] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    sanitizeCallsign(ThisAircraft.callsign, callsign, sizeof(callsign));
    if (callsign[0] == '\0')
    {
        snprintf(callsign, sizeof(callsign), "SELF%06lX", (unsigned long)(ThisAircraft.addr & 0xFFFFFFUL));
    }

    const bool hasUtc = GNSS_timeValid();
    const time_t t = hasUtc ? now() : 0;
    const int hourMsg = hasUtc ? hour(t) : 0;
    const int minMsg = hasUtc ? minute(t) : 0;

