MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/NMEA.cpp
    char body[256];  // Параметр геометрии, координаты, размера или угла.
    char sentence[280];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(body, sizeof(body),
             "FLYRF,%06lX,%d,%s,%d,%d,%d,%d,%d,%.6f,%.6f,%d,%d,%d,%d",
             (unsigned long)(ThisAircraft.addr & 0xFFFFFFUL),
             ThisAircraft.squawk,
             callsign,
             (int)lroundf(ThisAircraft.altitude),
             (int)lroundf(ThisAircraft.pressure_altitude),
             (int)lroundf(ThisAircraft.speed),
             (int)lroundf(ThisAircraft.course),
             ThisAircraft.vert_rate,
             (double)lat,
             (double)lon,
             (int)ThisAircraft.aircraft_type,
             1,
             hourMsg,
             minMsg);

    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - callsign: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - climbRate: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendAircraftPFLAA(const Aircraft& ac, int& totalObjects, float& hpDistance, int& hpRelNorth, int& hpRelEast, int& hpAltDiff, uint32_t& hpAddr)
{
    if (settings == nullptr) return;
    if (!ac.valid || ac.addr == 0U) return;
    if (!aircraftHasCoordinates(ac)) return;
    if (ThisAircraft.local_latitude == 0.0f && ThisAircraft.local_longitude == 0.0f) return;

    const int relNorth = (int)lroundf(ac.distance * cosf(ac.bearing * DEG_TO_RAD));
    const int relEast = (int)lroundf(ac.distance * sinf(ac.bearing * DEG_TO_RAD));
    const int relVertical = (int)lroundf(ac.altitude - ThisAircraft.altitude);
    const int alarmLevel = (ac.alarm_level >= 0) ? ac.alarm_level : 0;
    char callsign[16] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    sanitizeCallsign(ac.callsign, callsign, sizeof(callsign));
    if (callsign[0] == '\0')
    {
        makeFallbackCallsign(ac, callsign, sizeof(callsign));
    }

    char climbRate[12] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(climbRate, sizeof(climbRate), "%.1f", ac.vert_rate / 196.8504f);

    char body[220];  // Параметр геометрии, координаты, размера или угла.
    char sentence[244];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    snprintf(body, sizeof(body),
             "PFLAA,%d,%d,%d,%d,1,%06lX!%s,%d,,%d,%s,1",
             alarmLevel,
             relNorth,
             relEast,
             relVertical,
             (unsigned long)(ac.addr & 0xFFFFFFUL),
             callsign,
             (int)lroundf(ac.course),
             (int)lroundf(ac.speed * 0.514444f),
             climbRate);

    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    if (len > 0)
    {
        sendNmeaToConfiguredOutput(sentence, len);
        ++totalObjects;
        if (ac.distance < hpDistance)
        {
            hpDistance = ac.distance;
            hpRelNorth = relNorth;
            hpRelEast = relEast;
            hpAltDiff = relVertical;
            hpAddr = ac.addr & 0xFFFFFFUL;
        }
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - body: Параметр геометрии, координаты, размера или угла.
// - sentence: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void sendPFLAU(int totalObjects, float hpDistance, int hpRelNorth, int hpRelEast, int hpAltDiff, uint32_t hpAddr)
{
    if (settings == nullptr) return;

    char body[160];  // Параметр геометрии, координаты, размера или угла.
    char sentence[180];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    int relBearing = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (hpDistance < 1.0e9f)
    {
        relBearing = (int)lroundf(atan2f((float)hpRelEast, (float)hpRelNorth) * 57.2957795f - ThisAircraft.course);
        while (relBearing < -180) relBearing += 360;
        while (relBearing > 180) relBearing -= 360;
        snprintf(body, sizeof(body),
                 "PFLAU,%d,1,%d,1,0,%d,2,%d,%d,%06lX",
                 totalObjects,
                 GNSS_coordinatesValid() ? 2 : 0,
                 relBearing,
                 hpAltDiff,
                 (int)lroundf(hpDistance),
                 (unsigned long)hpAddr);
    }
    else
    {
        snprintf(body, sizeof(body),
                 "PFLAU,0,1,%d,1,0,,0,,,",
                 GNSS_coordinatesValid() ? 2 : 0);
    }
    const size_t len = wrapNMEALine(body, sentence, sizeof(sentence));
    sendNmeaToConfiguredOutput(sentence, len);
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует исходящий пакет, строку или ответ и отправляет его наружу.
// Локальные переменные:
// - line: Счетчик, индекс, позиция или номер элемента.
//------------------------------------------------------------------------------
static void sendAircraftContainer(const Aircraft& ac)
{
    char line[180];  // Счетчик, индекс, позиция или номер элемента.
    const int written = snprintf(line, sizeof(line),
                                 "ICAO=%06lX,SRC=%u,LAT=%.6f,LON=%.6f,ALT=%d,SPD=%.1f,CRS=%.1f,RSSI=%d,SNR=%.1f,AGE=%lu\r\n",
                                 (unsigned long)ac.icao,
                                 (unsigned)ac.source,
                                 ac.lat,
                                 ac.lon,
                                 (int)lroundf(ac.altitude),
                                 ac.speed,
                                 ac.course,
                                 ac.rssi,
                                 ac.snr,
                                 (unsigned long)(millis() - ac.lastUpdate));
    if (written > 0)
    {
        sendContainerToConfiguredOutputs(line, (size_t)written);
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void makeCallsignString(const char* src, char* dst, size_t dstSize)
{
    if (dst == nullptr || dstSize == 0)
    {
        return;
    }

    memset(dst, 0, dstSize);
    if (src == nullptr)
    {
        return;
    }

    const size_t copyLen = dstSize > 0 ? min((size_t)8, dstSize - 1) : 0;
    memcpy(dst, src, copyLen);
    dst[copyLen] = 0;
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и выводит данные на экран или во внешний интерфейс.
// Локальные переменные:
// - callsign: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void printLocalAircraftToSerial(const LocalAircraftState& ac)
{
    char callsign[9] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    makeCallsignString(ac.callsign, callsign, sizeof(callsign));
    Serial.printf("%06X:%d:%8s:%.0f:%.0f:%.0f:%.0f:%d:%.6f:%.6f\r\n",
                  (unsigned)(ac.addr & 0xFFFFFFUL),
                  ac.squawk,
                  callsign,
                  (double)ac.altitude,
                  (double)ac.altitude,
                  (double)ac.speed,
                  (double)ac.course,
                  ac.vert_rate,
                  (double)ac.latitude,
                  (double)ac.longitude);
    vTaskDelay(pdMS_TO_TICKS(4));
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и выводит данные на экран или во внешний интерфейс.
// Локальные переменные:
// - callsign: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void printContainerAircraftToSerial(const ufo_t* ac)
{
    if (ac == nullptr)
    {
        return;
    }

    char callsign[9] = {};  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    makeCallsignString(ac->callsign, callsign, sizeof(callsign));
    Serial.printf("%06X:%d:%8s:%.0f:%.0f:%.0f:%.0f:%d:%.6f:%.6f:%d:%d:%d\r\n",
                  (unsigned)(ac->addr & 0xFFFFFFUL),
                  ac->squawk,
                  callsign,
                  (double)ac->altitude,
                  (double)ac->altitude,
                  (double)ac->speed,
                  (double)ac->course,
                  ac->vert_rate,
                  (double)ac->latitude,
                  (double)ac->longitude,
                  (int)ac->rssi_LoRa,
                  (int)ac->rssi_rp2040,
                  (int)ac->signal_source);
    vTaskDelay(pdMS_TO_TICKS(4));
}

//------------------------------------------------------------------------------
// Назначение функции: Формирует и выводит данные на экран или во внешний интерфейс.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void printContainerDump(const ufo_t* arr, int n)
{
    if (arr == nullptr || n <= 0)
    {
        return;
    }
    for (int i = 0; i < n; ++i)
    {
        Serial.print("Container[");
        Serial.print(i);
        Serial.print("]:");
        printContainerAircraftToSerial(&arr[i]);
    }
    vTaskDelay(pdMS_TO_TICKS(4));
}

//------------------------------------------------------------------------------
// Назначение функции: Инициализирует модуль, подготавливает ресурсы и стартовые параметры.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
void NMEA_setup()
{
    memset(&g_diag, 0, sizeof(g_diag));
    g_lastAnnouncedSerialMode = 0xFFU;
    g_lastPgrmzMs = 0;

#if SOC_GPIO_PIN_RS485_DE >= 0
    pinMode(SOC_GPIO_PIN_RS485_DE, OUTPUT);
    digitalWrite(SOC_GPIO_PIN_RS485_DE, LOW);
#endif

#if SOC_GPIO_PIN_RS485_RX >= 0 && SOC_GPIO_PIN_RS485_TX >= 0
    if (settings == nullptr || settings->rs485_out != OUTPUT_MODE_RS485_DISPLAY)
    {
        RS485_SERIAL.setRxBufferSize(1024);
        RS485_SERIAL.setTxBufferSize(1024);
        RS485_SERIAL.begin(115200, SERIAL_8N1, SOC_GPIO_PIN_RS485_RX, SOC_GPIO_PIN_RS485_TX);
        g_rs485Ready = true;
    }
    else
    {
        g_rs485Ready = false;
    }
#else
    g_rs485Ready = false;
#endif

    g_diag.rs485Ready = g_rs485Ready;
}

//------------------------------------------------------------------------------
// Назначение функции: Периодически обслуживает модуль в основном цикле проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
void NMEA_loop()
{
    static uint32_t lastSendMs = 0;  // Временная отметка, интервал или значение тайм-аута.
    const uint32_t nowMs = millis();
    if ((uint32_t)(nowMs - lastSendMs) < NMEA_UPDATE_INTERVAL_MS)
    {
        return;
    }
    lastSendMs = nowMs;

    const Aircraft* list = TrafficDB.getList();

    NMEA_announceSerialModeIfNeeded();

