MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/NMEA.cpp
    if (settings != nullptr && settings->serial_out == OUTPUT_MODE_CONTAINER)
    {
        Serial.print("ThisAircraft:");
        printLocalAircraftToSerial(ThisAircraft);
        Serial.println("--------------------------------------------------------------------");
        printContainerDump(list, MAX_AIRCRAFT);
        Serial.println("===========================================================================");
    }

    sendOwnshipRMC();
    sendOwnshipGGA();
    sendOwnshipPGRMZ();

    int totalObjects = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    float hpDistance = 1.0e9f;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
    int hpRelNorth = 0;  // Параметр геометрии, координаты, размера или угла.
    int hpRelEast = 0;  // Параметр геометрии, координаты, размера или угла.
    int hpAltDiff = 0;  // Числовой параметр навигации, радиообмена, геометрии или измерения.
    uint32_t hpAddr = 0;  // Параметр конфигурации интерфейса, адресации или выбранного режима.

    for (int i = 0; i < MAX_AIRCRAFT; ++i)
    {
        if (!list[i].valid)
        {
            continue;
        }

        sendAircraftPFLAA(list[i], totalObjects, hpDistance, hpRelNorth, hpRelEast, hpAltDiff, hpAddr);
        sendAircraftContainer(list[i]);
    }

    sendPFLAU(totalObjects, hpDistance, hpRelNorth, hpRelEast, hpAltDiff, hpAddr);
    sendOwnshipFLYRF();

    ++g_diag.batchesSent;
    g_diag.lastBatchMs = nowMs;
}

//------------------------------------------------------------------------------
// Назначение функции: Завершает работу модуля и освобождает его ресурсы.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
void NMEA_fini()
{
    if (g_rs485Ready)
    {
        RS485_SERIAL.flush();
        RS485_SERIAL.end();
    }
    g_rs485Ready = false;
    g_diag.rs485Ready = false;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
bool NMEA_getDiag(NMEADiag& outDiag)
{
    outDiag = g_diag;
    return true;
}
